zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/clock/ch32v00x-clocks.h
/*
 * Copyright (c) 2024 Michael Hope
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file
 * @brief CH32V00x peripheral clock identifiers for devicetree bindings
 * @ingroup clock_contrcol_ch32
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_CH32V00X_CLOCKS_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_CH32V00X_CLOCKS_H_

#include "ch32-common.h"

/** @brief AHB bus register offset */
#define CH32_CLOCK_PCENR_HB  0x14
/** @brief APB2 bus register offset */
#define CH32_CLOCK_PCENR_PB2 0x18
/** @brief APB1 bus register offset */
#define CH32_CLOCK_PCENR_PB1 0x1C

/** @cond INTERNAL_HIDDEN */

#define CH32V00X_CLOCK_DMA1 CH32_CLOCK(HB, 0)
#define CH32V00X_CLOCK_SRAM CH32_CLOCK(HB, 2)

#define CH32V00X_CLOCK_AFIO   CH32_CLOCK(PB2, 0)
#define CH32V00X_CLOCK_IOPA   CH32_CLOCK(PB2, 2)
#define CH32V00X_CLOCK_IOPB   CH32_CLOCK(PB2, 3)
#define CH32V00X_CLOCK_IOPC   CH32_CLOCK(PB2, 4)
#define CH32V00X_CLOCK_IOPD   CH32_CLOCK(PB2, 5)
#define CH32V00X_CLOCK_ADC1   CH32_CLOCK(PB2, 9)
#define CH32V00X_CLOCK_TIM1   CH32_CLOCK(PB2, 11)
#define CH32V00X_CLOCK_SPI1   CH32_CLOCK(PB2, 12)
#define CH32V00X_CLOCK_USART2 CH32_CLOCK(PB2, 13)
#define CH32V00X_CLOCK_USART1 CH32_CLOCK(PB2, 14)

#define CH32V00X_CLOCK_TIM2 CH32_CLOCK(PB1, 0)
#define CH32V00X_CLOCK_TIM3 CH32_CLOCK(PB1, 2)
#define CH32V00X_CLOCK_WWDG CH32_CLOCK(PB1, 11)
#define CH32V00X_CLOCK_I2C1 CH32_CLOCK(PB1, 21)
#define CH32V00X_CLOCK_PWR  CH32_CLOCK(PB1, 28)

/** @endcond */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_CLOCK_CH32V00X_CLOCKS_H_ */
